{
    "setup":{
        "content":"<h1>\n        Welcome to Productivity Pal!\n      </h1>\n      <p>\n        This app helps you boost your productivity by recording your screen activity and sending it to Google Gemini for analysis. This analysis helps identify patterns in your work, to determine if you're being productive or not. When you're not productive it'll call you out to get you back on track.\n      </p>\n<p><b>Privacy Important:</b> By using this app, you agree to the following:</p>\n<ul>\n  <li><i>Screen Recording:</i> This app records everything on your screen, including websites you visit, applications you use, and any personal information displayed.</li>\n  <li><i>Data Transmission:</i> Recordings are periodically sent to Google Gemini for processing. No recordings are stored by Productivity Pal itself.</li>\n  <li><i>Google Gemini Terms:</i> Your use of this app is subject to Google's Gemini Terms of Service, including their data privacy and usage policies. Please review these terms carefully. You are responsible for ensuring that your screen recordings comply with Google's terms.</li>\n  <li><i>No Local Storage:</i> Productivity Pal does not store your screen recordings locally.</li>\n</ul>\nIf you understand and agree with these terms, click \"Start sharing my screen\" to begin using the app and start the screen recording. If you rather not be recorded, click \"Quit\" to exit.\n      </p>"
    },
    "restricted":{
        "content":"<h1>\n        No permission!\n      </h1>\n      <p>\n        Oh no! It looks like you didn't give us the proper permission to record. If you want us to help you boost your productivity, we need permission to record your screen activity and sending it to Google Gemini for analysis. This analysis helps identify patterns in your work, to determine if you're being productive or not. When you're not productive it'll call you out to get you back on track.\n      </p>\n<p><b>Privacy Important:</b> By using this app, you agree to the following:</p>\n<ul>\n  <li><i>Screen Recording:</i> This app records everything on your screen, including websites you visit, applications you use, and any personal information displayed.</li>\n  <li><i>Data Transmission:</i> Recordings are periodically sent to Google Gemini for processing. No recordings are stored by Productivity Pal itself.</li>\n  <li><i>Google Gemini Terms:</i> Your use of this app is subject to Google's Gemini Terms of Service, including their data privacy and usage policies. Please review these terms carefully. You are responsible for ensuring that your screen recordings comply with Google's terms.</li>\n  <li><i>No Local Storage:</i> Productivity Pal does not store your screen recordings locally.</li>\n</ul>\nIf you understand and agree with these terms, click \"Start sharing my screen\" to begin using the app and start the screen recording. If you rather not be recorded, click \"Quit\" to exit.\n      </p>"
    },
    "recording":{
        "content":"<h1>\n        Recording!\n      </h1>\n      <p>\n        We'll let you know when we have an update on your productivity.</p>"
    }
}